Tekla.Structures.ModelInternal.Dstv.DstvNumeration
The dstv numeration block information.

Tekla.Structures.ModelInternal.Dstv.DstvNumeration.#ctor
Creates a new DstvNumeration instance.

Tekla.Structures.ModelInternal.Dstv.DstvNumeration.DstvView
The dstv view type: front, top, back or below

Tekla.Structures.ModelInternal.Dstv.DstvNumeration.Position
The insertion point position.

Tekla.Structures.ModelInternal.Dstv.DstvNumeration.Angle
The angle.

Tekla.Structures.ModelInternal.Dstv.DstvNumeration.TextHeight
The height of the text.

Tekla.Structures.ModelInternal.Dstv.DstvNumeration.Text
The text.